{"name": "AddSimpleModelTimed", "notes": "\n useartwork must be enabled first in server settings in order for this to work\n When virtualworld is set, the models will be downloaded once the player enters the specific world", "warnings": "There are currently no restrictions on when you can call this function, but be aware that if you do not call them inside OnFilterScriptInit/OnGameModeInit, you run the risk that some players, who are already on the server, may not have downloaded the models.", "versions": "This function was added in SA-MP 0.3.DL R1 and will not work in earlier versions!", "tips": null, "outdated": null, "lowercase": null, "description": "Adds a new custom simple object model for download. The model files will be stored in player's Documents\\GTA San Andreas User Files\\SAMP\\cache under the Server IP and Port folder in a CRC-form file name.", "params_title": "(virtualworld, baseid, newid, dffname[], txdname[], timeon, timeoff)", "params_body": [{"name": "virtualworld", "description": "The virtual world ID to make the model available at. Use -1 for all worlds."}, {"name": "baseid", "description": "The base object model ID to use (original object to use when download is failed)."}, {"name": "newid", "description": "The new object model ID ranged from -1000 to -30000 (29000 slots) to be used later with CreateObject or CreatePlayerObject."}, {"name": "dffname", "description": "Name of the .dff model collision file located in models server folder by default (artpath setting)."}, {"name": "txdname", "description": "Name of the .txd model texture file located in models server folder by default (artpath setting)."}, {"name": "timeon", "description": "The world game time (hour) this object will appear"}, {"name": "timeoff", "description": "The world game time (hour) this object will disappear"}], "return_values": " 1: The function executed successfully. \n\n 0: The function failed to execute. ", "pawn_code": ["public OnGameModeInit()\n{\n\tAddSimpleModelTimed(-1, 19379, -2000, \"wallzzz.dff\", \"wallzzz.txd\", 9, 18); // This wall only renders from 9:00 am to 6:00 pm\n\treturn 1;\n}"], "code": [], "related_fn": [" OnPlayerFinishedDownloading: Called when a player finishes downloading custom models.\n"], "related_cb": [" OnPlayerFinishedDownloading: Called when a player finishes downloading custom models.\n"]}