{"name": "ApplyAnimation", "notes": "The 'forcesync' optional parameter, which defaults to 0, in most cases is not needed since players sync animations themselves. The 'forcesync' parameter can force all players who can see 'playerid' to play the animation regardless of whether the player is performing that animation. This is useful in circumstances where the player can't sync the animation themselves. For example, they may be paused.", "warnings": "An invalid animation library will crash the player's game.", "versions": null, "tips": null, "outdated": null, "lowercase": null, "description": "Apply an animation to a player.", "params_title": "(playerid, animlib[], animname[], Float:fDelta, loop, lockx, locky, freeze, time, forcesync)", "params_body": [{"name": "playerid", "description": "The ID of the player to apply the animation to."}, {"name": "animlib[]", "description": "The animation library from which to apply an animation."}, {"name": "animname[]", "description": "The name of the animation to apply, within the specified library."}, {"name": "fDelta", "description": "The speed to play the animation (use 4.1)."}, {"name": "loop", "description": "If set to 1, the animation will loop. If set to 0, the animation will play once."}, {"name": "lockx", "description": "If set to 0, the player is returned to their old X coordinate once the animation is complete (for animations that move the player such as walking). 1 will not return them to their old position."}, {"name": "locky", "description": "Same as above but for the Y axis. Should be kept the same as the previous parameter."}, {"name": "freeze", "description": "Setting this to 1 will freeze the player at the end of the animation. 0 will not."}, {"name": "time", "description": "Timer in milliseconds. For a never-ending loop it should be 0."}, {"name": "forcesync", "description": "Set to 1 to make server sync the animation with all other players in streaming radius (optional). 2 works same as 1, but will ONLY apply the animation to streamed-in players, but NOT the actual player being animated (useful for npc animations and persistent animations when players are being streamed) "}], "return_values": "This function always returns 1, even if the player specified does not exist, or any of the parameters are invalid (e.g. invalid library).", "pawn_code": ["ApplyAnimation(playerid, \"PED\", \"WALK_DRUNK\", 4.1, 1, 1, 1, 1, 1, 1);"], "code": [], "related_fn": [" ClearAnimations: Clear any animations a player is performing.\n", " SetPlayerSpecialAction: Set a player's special action.\n"], "related_cb": []}