{"name": "AttachObjectToVehicle", "notes": "The object must be created first.", "warnings": "When the vehicle is destroyed or respawned, the attached objects won't be destroyed with it; they will remain stationary at the position the vehicle disappeared and be reattached to the next vehicle to claim the vehicle ID that the objects were attached to.", "versions": "This function was added in SA-MP 0.3c  and will not work in earlier versions!", "tips": null, "outdated": null, "lowercase": null, "description": "Attach an object to a vehicle.", "params_title": "(objectid, vehicleid, Float:OffsetX, Float:OffsetY, Float:OffsetZ, Float:RotX, Float:RotY, Float:RotZ)", "params_body": [{"name": "objectid", "description": "The ID of the object to attach to the vehicle. Note that this is an object ID, not a model ID. The object must be CreateObject created first."}, {"name": "vehicleid", "description": "The ID of the vehicle to attach the object to."}, {"name": "Float:OffsetX", "description": "The X axis offset from the vehicle to attach the object to."}, {"name": "Float:OffsetY", "description": "The Y axis offset from the vehicle to attach the object to."}, {"name": "Float:OffsetZ", "description": "The Z axis offset from the vehicle to attach the object to."}, {"name": "Float:RotX", "description": "The X rotation offset for the object."}, {"name": "Float:RotY", "description": "The Y rotation offset for the object."}, {"name": "Float:RotZ", "description": "The Z rotation offset for the object."}], "return_values": "This function does not return any specific values.", "pawn_code": ["new objectid = CreateObject(...);\nnew vehicleid = GetPlayerVehicleID(playerid);\nAttachObjectToVehicle(objectid, vehicleid, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0);"], "code": [], "related_fn": [" AttachObjectToPlayer: Attach an object to a player.\n", " AttachObjectToObject: Attach an object to an object.\n", " AttachPlayerObjectToPlayer: Attach a player object to a player.\n", " CreateObject: Create an object.\n", " DestroyObject: Destroy an object.\n", " IsValidObject: Checks if a certain object is vaild.\n", " MoveObject: Move an object.\n", " StopObject: Stop an object from moving.\n", " SetObjectPos: Set the position of an object.\n", " SetObjectRot: Set the rotation of an object.\n", " GetObjectPos: Locate an object.\n", " GetObjectRot: Check the rotation of an object.\n", " CreatePlayerObject: Create an object for only one player.\n", " DestroyPlayerObject: Destroy a player object.\n", " IsValidPlayerObject: Checks if a certain player object is vaild.\n", " MovePlayerObject: Move a player object.\n", " StopPlayerObject: Stop a player object from moving.\n", " SetPlayerObjectPos: Set the position of a player object.\n", " SetPlayerObjectRot: Set the rotation of a player object.\n", " GetPlayerObjectPos: Locate a player object.\n", " GetPlayerObjectRot: Check the rotation of a player object.\n"], "related_cb": []}