{"name": "GetPlayerNetworkStats", "tags": ["player"], "notes": "This function may not return accurate data when used under OnPlayerDisconnect if the player has quit normally. It usually returns accurate data if the player has been kicked or has timed out.", "warnings": null, "versions": "This function was added in SA-MP 0.3c R4 and will not work in earlier versions!", "tips": null, "outdated": null, "lowercase": null, "description": "Gets a player's network stats and saves them into a string.", "params_title": "(playerid, retstr[], retstr_size)", "params_body": [{"name": "playerid", "description": "The ID of the player you want to get the networkstats of."}, {"name": "retstr[]", "description": "The string to store the networkstats in, passed by reference."}, {"name": "retstr_size", "description": "The length of the string that should be stored."}], "return_values": "This function always returns 1.", "pawn_code": ["public OnPlayerCommandText(playerid,cmdtext[])\n{    \n    if(!strcmp(cmdtext, \"/mynetstats\"))\n    {\n        new stats[400+1];\n        GetPlayerNetworkStats(playerid, stats, sizeof(stats)); // get your own networkstats\n        ShowPlayerDialog(playerid, 0, DIALOG_STYLE_MSGBOX, \"My NetworkStats\", stats, \"Okay\", \"\");\n    }\n    return 1;\n}"], "code": [], "related_fn": [" GetNetworkStats: Gets the servers networkstats and saves it into a string.\n", " NetStats_GetConnectedTime: Get the time that a player has been connected for.\n", " NetStats_MessagesReceived: Get the number of network messages the server has received from the player.\n", " NetStats_BytesReceived: Get the amount of information (in bytes) that the server has received from the player.\n", " NetStats_MessagesSent: Get the number of network messages the server has sent to the player.\n", " NetStats_BytesSent: Get the amount of information (in bytes) that the server has sent to the player.\n", " NetStats_MessagesRecvPerSecond: Get the number of network messages the server has received from the player in the last second.\n", " NetStats_PacketLossPercent: Get a player's packet loss percent.\n", " NetStats_ConnectionStatus: Get a player's connection status.\n", " NetStats_GetIpPort: Get a player's IP and port.\n"], "related_cb": []}