{"name": "strfind pt", "notes": null, "warnings": null, "versions": null, "tips": null, "outdated": null, "lowercase": null, "params_title": "(const string[],const sub[],bool:ignorecase=false,pos=0)", "params_body": [{"name": "const string[]", "description": "A string que vai ser procurada a a sub string (haystack - palheiro)."}, {"name": "const sub[]", "description": "A sub string que vai ser procurada (needle - agulha)."}, {"name": "ignorecase (opcional)", "description": "Se for usado true ignora a diferença entre letras maiúsculas e minúsculas, caso contrário faz essa diferença."}, {"name": "Position (opcional)", "description": "A posição onde vai começar a procura."}], "return_values": ["A posição inicial onde se encontra a sub string ou -1 se não for encontrado."], "pawn_code": ["if(strfind(\"Are you in here?\", \"you\", true) != -1) //retorna 4, pois a palavra 'you' (y) começa no índice 4 da string\n{\n    SendClientMessageToAll(0xFFFFFFFF, \"I found you!\");\n}"], "code": [], "related_fn": [" format: Formata uma string.\n", " strlen: Pega o tamanho de uma string.\n", " strpack: Compacta uma string e armazena em uma string de destino.\n", " strunpack: Descompacta uma string. \n", " strcat: Concatena duas strings. \n", " strmid: Extrai uma sequência de caracteres de uma string. \n", " strins: Insere uma sequência de caracteres em uma determinada posição de uma string.\n", " strdel: Delete uma parte da string a partir de uma posição inicial e final.\n", " strcmp: Compara duas strings para ver se são iguais.\n", " strfind: Procura uma sequência de caracteres dentro de uma string. \n", " strval: Converte uma string para números inteiros\n", " valstr: Converte um número para uma string.\n", " ispacked: Verifica se uma string esta compactada.\n", " uudecode: Decodifica um string codificada com a função uuencode.\n", " uuencode: Codifica uma string para ser decodificada com a função uudecode. \n", " memcpy: Copia bytes de uma array para outra array.\n"], "related_cb": []}