{"name": "TextDrawTextSize", "notes": "\nThe x and y have different meanings with different TextDrawAlignment values:\n1 (left): they are the right-most corner of the box, absolute coordinates.\n2 (center): they need to inverted (switch the two) and the x value is the overall width of the box.\n3 (right): the x and y are the coordinates of the left-most corner of the box\n\n Using font type 4 (sprite) and 5 (model preview) converts X and Y of this function from corner coordinates to WIDTH and HEIGHT (offsets).\n The TextDraw box starts 10.0 units up and 5.0 to the left as the origin (TextDrawCreate coordinate).\n This function defines the clickable area for use with TextDrawSetSelectable, whether a box is shown or not.", "warnings": null, "versions": null, "tips": "If you want to change the text size of a textdraw that is already shown, you don't have to recreate it. Simply use TextDrawShowForPlayer/TextDrawShowForAll after modifying the textdraw and the change will be visible.", "outdated": null, "lowercase": null, "description": "Change the size of a textdraw (box if TextDrawUseBox is enabled and/or clickable area for use with TextDrawSetSelectable).", "params_title": "(Text:text, Float:x, Float:y)", "params_body": [{"name": "text", "description": "The TextDraw to set the size of."}, {"name": "Float:x", "description": "The size on the X axis (left/right) following the same 640x480 grid as TextDrawCreate."}, {"name": "Float:y", "description": "The size on the Y axis (up/down) following the same 640x480 grid as TextDrawCreate."}], "return_values": "This function does not return any specific values.", "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    MyTextDraw = TextDrawCreate(100.0, 33.0,\"Example TextDraw\");\n    TextDrawTextSize(MyTextDraw, 2.0, 3.6);\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}