{"name": "TextDrawUseBox", "tags": ["textdraw"], "notes": "If the textdraw is already shown, it must be re-shown (TextDrawShowForAll/TextDrawShowForPlayer) to show the changes of this function.", "warnings": null, "versions": null, "tips": null, "outdated": null, "lowercase": null, "description": "Toggle whether a textdraw uses a box or not.", "params_title": "(Text:text, use)", "params_body": [{"name": "text", "description": "The ID of the text textdraw to toggle the box of."}, {"name": "use", "description": "1 to show a box or 0 to not show a box."}], "return_values": " 1: The function executed successfully. \n\n 0: The function failed to execute. This means the textdraw specified does not exist.", "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    MyTextDraw = TextDrawCreate(100.0, 33.0, \"Example TextDraw\");\n    TextDrawUseBox(MyTextDraw, 1); // Toggle box ON\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}