{"name": "TextDrawSetShadow", "notes": "The shadow can be cut by the box area if the size is set too big for the area.", "warnings": null, "versions": null, "tips": "If you want to change the shadow of a textdraw that is already shown, you don't have to recreate it. Simply use TextDrawShowForPlayer/TextDrawShowForAll after modifying the textdraw and the change will be visible.", "outdated": null, "lowercase": null, "description": "Sets the size of a textdraw's text's shadow.", "params_title": "(Text:text, size)", "params_body": [{"name": "text", "description": "The ID of the textdraw to set the shadow size of."}, {"name": "size", "description": "The size of the shadow. 1 is generally used for a normal shadow size. 0 disables the shadow completely."}], "return_values": " 1: The function executed successfully. \n\n 0: The function failed to execute. The textdraw does not exist.", "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    MyTextDraw = TextDrawCreate(100.0, 33.0, \"Example TextDraw\");\n    TextDrawSetShadow(MyTextDraw, 1);\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}