{"name": "TextDrawLetterSize", "notes": "When using this function purely for the benefit of affecting the TextDraw box, multiply 'Y' by 0.135 to convert to TextDrawTextSize-like measurements. Hint: it is easier and extremely precise to use  LD_SPAC:white  sprite for box-only textdraws, TextDrawTextSize will have regular offsets.", "warnings": null, "versions": null, "tips": "\n If you want to change the letter size of a textdraw that is already shown, you don't have to recreate it. Simply use TextDrawShowForPlayer/TextDrawShowForAll after modifying the textdraw and the change will be visible.\n Fonts appear to look the best with an X to Y ratio of 1 to 4 (e.g. if x is 0.5 then y should be 2).", "outdated": null, "lowercase": null, "description": "Sets the width and height of the letters.", "params_title": "(Text:text, Float:x, Float:y)", "params_body": [{"name": "text", "description": "The TextDraw to change"}, {"name": "Float:x", "description": "Width of a char."}, {"name": "Float:y", "description": "Height of a char."}], "return_values": ["This function does not return any specific values."], "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    MyTextDraw = TextDrawCreate(100.0, 33.0,\"Example TextDraw\");\n    TextDrawLetterSize(MyTextDraw, 3.2 ,5.1);\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}