{"name": "TextDrawCreate", "notes": "\n The x,y coordinate is the top left coordinate for the text draw area based on a 640x448 \"canvas\" (irrespective of screen resolution). If you plan on using TextDrawAlignment with alignment 3 (right), the x,y coordinate is the top right coordinate for the text draw.\n This function merely CREATES the textdraw, you must use TextDrawShowForPlayer or TextDrawShowForAll to show it.\n It is recommended to use WHOLE numbers instead of decimal positions when creating textdraws to ensure resolution friendly design.", "warnings": "Keyboard key mapping codes (such as ~k~~VEHICLE_ENTER_EXIT~ don't work beyond 255th character.\n", "versions": null, "tips": null, "outdated": null, "lowercase": null, "description": "Creates a textdraw. Textdraws are, as the name implies, text (mainly - there can be boxes, sprites and model previews (skins/vehicles/weapons/objects too) that is drawn on a player's screens. See this page for extensive information about textdraws.", "params_title": "(Float:x, Float:y, text[])", "params_body": [{"name": "Float:x", "description": "The X (left/right) coordinate to create the textdraw at."}, {"name": "Float:y", "description": "The Y (up/down) coordinate to create the textdraw at."}, {"name": "text[]", "description": "The text that will appear in the textdraw."}], "return_values": ["The ID of the created textdraw. Textdraw IDs start at 0."], "pawn_code": ["// This variable is used to store the id of the textdraw\n// so that we can use it throught the script\nnew Text:welcomeText; \n \npublic OnGameModeInit()\n{\n    // This line is used to create the textdraw. \n    // Note: This creates a textdraw without any formatting.\n    welcomeText = TextDrawCreate(240.0,580.0,\"Welcome to my SA-MP server\");\n    return 1;\n}\n \npublic OnPlayerConnect(playerid)\n{\n    //This is used to show the player the textdraw when they connect.\n    TextDrawShowForPlayer(playerid,welcomeText);\n}"], "code": [], "related_fn": [" TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}