{"name": "TextDrawBoxColor", "notes": null, "warnings": null, "versions": null, "tips": "If you want to change the boxcolour of a textdraw that is already shown, you don't have to recreate it. Simply use TextDrawShowForPlayer/TextDrawShowForAll after modifying the textdraw and the change will be visible.", "outdated": null, "lowercase": null, "description": "Adjusts the text box colour (only used if TextDrawUseBox 'use' parameter is 1).", "params_title": "(Text:text, color)", "params_body": [{"name": "text", "description": "The TextDraw to change"}, {"name": "color", "description": "The colour. Opacity is set by the alpha intensity of colour (eg. color 0x000000FF has a solid black box opacity, whereas 0x000000AA has a semi-transparent black box opacity)."}], "return_values": ["This function does not return any specific values."], "pawn_code": ["new Text:Example;\n \npublic OnGameModeInit()\n{\n    Example = TextDrawCreate(123.0, 123.0,\"Example\");\n    TextDrawUseBox(Example, 1);\n    TextDrawBoxColor(Example, 0xFFFFFFFF);\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}