{"name": "TextDrawSetOutline", "tags": ["textdraw"], "kind": "functions", "notes": null, "warnings": null, "versions": null, "tips": "If you want to change the outline of a textdraw that is already shown, you don't have to recreate it. Simply use TextDrawShowForPlayer/TextDrawShowForAll after modifying the textdraw and the change will be visible.", "outdated": null, "lowercase": null, "description": "Sets the thickness of a textdraw's text's outline. TextDrawBackgroundColor can be used to change the color.", "params_title": "(Text:text, size)", "params_body": [{"name": "text", "description": "The ID of the text draw to set the outline thickness of."}, {"name": "size", "description": "The thickness of the outline, as an integer. 0 for no outline."}], "return_values": "This function does not return any specific values.", "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    MyTextDraw = TextDrawCreate(100.0, 33.0, \"Example TextDraw\");\n    TextDrawSetOutline(MyTextDraw, 1);\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}