{"name": "TextDrawFont", "tags": ["textdraw"], "kind": "functions", "notes": null, "warnings": null, "versions": null, "tips": "If you want to change the font of a textdraw that is already shown, you don't have to recreate it. Simply use TextDrawShowForPlayer/TextDrawShowForAll after modifying the textdraw and the change will be visible.", "outdated": null, "lowercase": null, "description": "Changes the text font.", "params_title": "(Text:text, font)", "params_body": [{"name": "text", "description": "The TextDraw to change"}, {"name": "font", "description": "There are four font styles as shown below. Font value 4 specifies that this is a txd sprite; 5 specifies that this textdraw can display preview models. A font value greater than 5 does not display, and anything greater than 16 crashes the client.\nAvailable Styles:\n\nAvailable Fonts:\n\n"}], "return_values": "This function does not return any specific values.", "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    MyTextdraw= TextDrawCreate(320.0, 425.0, \"This is an example textdraw\");\n    TextDrawFont(MyTextdraw, 2);\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawAlignment: Set the alignment of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}