{"name": "TextDrawAlignment", "tags": ["textdraw"], "kind": "functions", "notes": "If the textdraw is already shown, it must be re-shown (TextDrawShowForAll/TextDrawShowForPlayer) to show the changes of this function.", "warnings": null, "versions": null, "tips": null, "outdated": null, "lowercase": null, "description": "Set the alignment of text in a text draw.", "params_title": "(Text:text, alignment)", "params_body": [{"name": "Text:text", "description": "The ID of the textdraw to set the alignment of."}, {"name": "alignment", "description": "1-left 2-centered 3-right."}], "return_values": "\n\n\n\nNote\n\nFor alignment 2 (center) the x and y values of TextSize need to be swapped, see notes at TextDrawTextSize, also position coordinate become position of center of textdraw and not left/top edges.\n\n", "pawn_code": ["new Text:MyTextdraw;\n \npublic OnGameModeInit()\n{\n    new Text:MyTextdraw = TextDrawCreate(320.0, 425.0, \"This is an example textdraw\");\n    TextDrawAlignment(MyTextdraw, 2); // Align the textdraw text in the center\n    return 1;\n}"], "code": [], "related_fn": [" TextDrawCreate: Create a textdraw.\n", " TextDrawDestroy: Destroy a textdraw.\n", " TextDrawColor: Set the color of the text in a textdraw.\n", " TextDrawBoxColor: Set the color of the box in a textdraw.\n", " TextDrawBackgroundColor: Set the background color of a textdraw.\n", " TextDrawFont: Set the font of a textdraw.\n", " TextDrawLetterSize: Set the letter size of the text in a textdraw.\n", " TextDrawTextSize: Set the size of a textdraw box.\n", " TextDrawSetOutline: Choose whether the text has an outline.\n", " TextDrawSetShadow: Toggle shadows on a textdraw.\n", " TextDrawSetProportional: Scale the text spacing in a textdraw to a proportional ratio.\n", " TextDrawUseBox: Toggle if the textdraw has a box or not.\n", " TextDrawSetString: Set the text in an existing textdraw.\n", " TextDrawShowForPlayer: Show a textdraw for a certain player.\n", " TextDrawHideForPlayer: Hide a textdraw for a certain player.\n", " TextDrawShowForAll: Show a textdraw for all players.\n", " TextDrawHideForAll: Hide a textdraw for all players.\n"], "related_cb": []}